{
  "location" : null,
  "attendance" : [ "Remote" ],
  "type" : null,
  "experience" : null,
  "salary" : null,
  "tags" : [ "Marketing", "Digital Marketing", "Marketing Consultant", "Marketing Strategy", "Data-Driven Marketing" ],
  "skills" : [ "Digital Marketing", "eCRM", "Performance Marketing", "Landing Page Optimization", "Analytical Skills", "Project Management" ],
  "overview" : "Superside is looking for a Marketing Consultant Specialist to develop digital marketing plans for customers and translate marketing strategies into actionable plans.",
  "description" : "Superside is seeking a Marketing Consultant Specialist to join our Advertising Creative Strategy Services team. In this role, you will develop holistic and pragmatic digital marketing plans for customers, leveraging various marketing channels. You will collaborate with internal teams and customers to ensure alignment with business objectives and goals. Additionally, you will conduct marketing activity audits, provide recommendations for optimization, and stay up-to-date on digital marketing best practices and trends.\n\nAs a Marketing Consultant Specialist, you will play a crucial role in growing our team and shaping our team culture and processes. We offer continuous learning opportunities, career development, and a flexible and collaborative work environment. Join us in disrupting the global industry and making an impact!",
  "requirements" : [ "Bachelor's degree in Marketing, Communications, Business, or related field", "5+ years of experience in digital marketing, preferably in a tech, consulting, or agency environment", "Proven track record of developing and executing successful data-driven digital marketing plans", "Strong expertise in key areas of digital marketing such as eCRM, Performance Marketing, Landing Page Optimization", "Excellent analytical and problem-solving skills", "Exceptional English communication and presentation skills", "Strong project management skills", "Self-motivated, results-driven, and detail-oriented" ]
}