{
  "location" : [ "Remote" ],
  "attendance" : null,
  "type" : null,
  "experience" : [ "3+ years" ],
  "salary" : null,
  "tags" : [ "Creative", "Project Manager" ],
  "skills" : [ "Project Management", "Account Management", "Creative Communication", "Adobe Suite", "Figma", "Digital Advertising", "Social Media", "Branding", "Communication" ],
  "overview" : "Superside is looking for Creative Project Managers to strengthen their team. Joining the Creative Services department, you'll build and deliver creative strategy and assets for some of the most innovative companies on the planet—all while working in a global remote community focused on making the future of work brilliant.",
  "description" : "Superside is the leading Creative-as-a-Service (CaaS) company that helps over 450 ambitious brands get great design and creative done at scale. With our design subscription service, marketing and creative teams can unbottleneck design, move faster and drive more reliable creative performance. We help the world's leading companies like Google, Meta, Amazon, Salesforce, Red Bull and Boston Consulting Group with advertising creative, brand design, video production and more. No longer chained to over-taxed in-house creative teams, our customers reduce costs and move quickly with infinite scale.",
  "requirements" : [ "3+ years of experience as a Project/Account/Campaign manager, or Creative producer within a brand or advertising function", "Excellent understanding of creative communication and how creative content can drive business outcomes", "Understanding of creative craft with a solid ability to scope and budget", "Familiarity with the Adobe Suite (Ps, Ai, Ae, Id) and Figma", "High-level understanding of Digital advertising and social media platforms, or Branding and communications", "An organized, customer-centric and detail-oriented approach, with an account management mindset", "Excellent verbal and written English skills required to present ideas and coordinate work in large international groups", "Autonomy, decisiveness, and accountability" ]
}