{
  "location" : null,
  "attendance" : null,
  "type" : null,
  "experience" : null,
  "salary" : null,
  "tags" : null,
  "skills" : null,
  "overview" : "Superside is looking for a driven Senior Product Designer to help us make our briefing experience completely hassle-free.",
  "description" : "Superside is looking for a driven Senior Product Designer to help us make our briefing experience completely hassle-free. Becoming a part of our Product Design team in the Tech, Product &amp; Design department, you’ll play a key role in designing Superside's collaboration and project management platform—Superspace—that helps our customers \"unbottleneck\" their creative needs. You’ll get to design UI components according to the best practices for interaction and experience. This role will enable our team to prototype, test and validate our product hypothesis faster. Reporting to the Design Director, you’ll be responsible for conceptualizing and building an easy-to-use platform, helping us create a seamless and delightful experience within Superspace.",
  "requirements" : [ "4 years of relevant experience designing exceptional enterprise-class applications", "Demonstrable experience building digital products from conception to delivery", "Knowledge of the end-to-end design process (discovery and delivery)", "Experience identifying and prioritizing opportunities, forming hypotheses, creating experiments, and collaboratively creating success metrics", "Great communication skills and familiarity with technical language to facilitate collaboration with other teams", "Knowledge of best practices for accessibility and experience designing for different devices and screen sizes", "Organization skills needed to create and maintain easy-to-use documentation", "Familiarity working in a cross-disciplinary environment, where experimentation and testing are valued", "Business-oriented, data-driven, detail-oriented and autonomous mindset", "Ability to communicate your ideas, concepts and insights clearly" ]
}